Repository: ibrahimysr/Story-Tale-Creator
Catalog: lib/l10n/app_*.arb
Languages: es, tr

# profileTitle
source: Profile
es: Perfil
tr: Profil

source: Checking Authentication...
es: Comprobando Autenticación...
tr: Kimlik Doğrulama Kontrol Ediliyor...

source: Help & Support
es: Ayuda & Soporte
tr: Yardım & Destek

source: Sign Out
es: Cerrar Sesión
tr: Çıkış Yap

# errorOccurred
source: An error occurred
es: Ha ocurrido un error
tr: Bir hata oluştu

source: Try Again
es: Intentar de Nuevo
tr: Tekrar Dene

source: Profile not found
es: Perfil no encontrado
tr: Profil bulunamadı

source: Stories
es: Historias
tr: Hikayeler

# mystorie
source: My Story
es: Mi Historia
tr: Hikayem

source: Total Likes
es: Total de Me Gusta
tr: Toplam Beğeni

# signOutError
source: Error signing out: {error}
es: Error al cerrar sesión: {error}
tr: Çıkış yapılırken hata oluştu: {error}

source: Language
es: Idioma
tr: Dil

source: Turkish
es: Turco
tr: Türkçe

source: English
es: Inglés
tr: İngilizce

source: Spanish
es: España
tr: İspanyolca

# authRequiredTitle
source: Authentication Required
es: Necesitas Iniciar Sesión
tr: Giriş Yapmanız Gerekiyor

# authRequiredMessage
source: Please log in or sign up to view your profile.
es: Por favor inicia sesión o regístrate para ver tu perfil.
tr: Profil Sayfasını Görmek İçin Lütfen Giriş Yapınız

source: Login
es: Iniciar Sesión
tr: Giriş Yap

source: Sign Up
es: Registrarse
tr: Kayıt Ol

source: Edit Profile
es: Editar Perfil
tr: Profili Düzenle

source: Name
es: Nombre
tr: İsim

# enterDisplayName
source: Enter your display name
es: Ingresa tu nombre visible
tr: Görünen adınızı girin

source: Name cannot be empty
es: El nombre no puede estar vacío
tr: İsim boş bırakılamaz

# nameMinLength
source: Name must be at least 2 characters
es: El nombre debe tener al menos 2 caracteres
tr: İsim en az 2 karakter olmalıdır

source: Username
es: Nombre de Usuario
tr: Kullanıcı Adı

# enterUniqueUsername
source: Enter your unique username
es: Ingresa un nombre de usuario único
tr: Benzersiz kullanıcı adınızı girin

source: Username cannot be empty
es: El nombre de usuario no puede estar vacío
tr: Kullanıcı adı boş bırakılamaz

# usernameMinLength
source: Username must be at least 3 characters
es: El nombre de usuario debe tener al menos 3 caracteres
tr: Kullanıcı adı en az 3 karakter olmalıdır

# usernameFormat
source: Only letters, numbers, and underscores are allowed
es: Solo se pueden usar letras, números y guiones bajos
tr: Sadece harf, rakam ve alt çizgi kullanılabilir

source: Save Changes
es: Guardar Cambios
tr: Değişiklikleri Kaydet

# deleteAccount
source: Delete My Account
es: Eliminar Mi Cuenta
tr: Hesabımı Sil

# deleteAccountConfirmation
source: Are you sure you want to delete your account?
es: ¿Estás seguro de que quieres eliminar tu cuenta?
tr: Hesabını silmek istediğinden emin misin?

# deleteAccountWarning
source: Your email address and created content will be permanently deleted. Do you want to continue?
es: Tu dirección de correo electrónico y el contenido que has creado se eliminarán permanentemente. ¿Quieres continuar?
tr: Mail adresiniz ve oluşturduğunuz içerikler kalıcı olarak silinecektir. Devam etmek istiyor musun?

source: Yes
es: Sí
tr: Evet

source: Close
es: Cerrar
tr: Kapat

source: Space Journey
es: Viaje Espacial
tr: Uzay Yolculuğu

source: Galactic Email
es: Correo Galáctico
tr: Galaktik E-posta

# enterEmail
source: Please enter your email address
es: Por favor ingresa tu dirección de correo electrónico
tr: Lütfen e-posta adresinizi girin

# invalidEmail
source: The email address is invalid. Please check the star maps and try again!
es: Tu dirección de correo electrónico no es válida. ¡Por favor verifica tus mapas estelares e intenta de nuevo!
tr: E-posta adresiniz geçerli değil. Lütfen yıldız haritalarını kontrol edin ve tekrar deneyin!

source: Secret Password
es: Contraseña Secreta
tr: Gizli Şifre

# enterPassword
source: Please enter your password
es: Por favor ingresa tu contraseña
tr: Lütfen şifrenizi girin

# passwordMinLength
source: Password must be at least 6 characters
es: La contraseña debe tener al menos 6 caracteres
tr: Şifre en az 6 karakter olmalıdır

source: Forgot Password
es: Olvidé mi Contraseña
tr: Şifremi Unuttum

source: Enter Galaxy
es: Entrar a la Galaxia
tr: Galaksiye Giriş Yap

# loginTitle
source: Galactic Entry
es: Inicio de Sesión Galáctico
tr: Galaktik Giriş

# newExplorerRegister
source: Are you a new explorer? Register
es: ¿Eres un nuevo explorador? Regístrate
tr: Yeni bir kaşif misin? Kayıt ol

# continueWithoutRegister
source: Continue Without Registering
es: Continuar sin Registrarse
tr: Kayıt Olmadan Devam Et

source: Select Avatar
es: Seleccionar Avatar
tr: Avatar Seç

source: Explorer Name
es: Nombre de Explorador
tr: Kaşif Adı

# enterExplorerName
source: Please enter an explorer name
es: Por favor ingresa un nombre de explorador
tr: Lütfen bir kaşif adı girin

source: Join Adventure
es: Únete a la Aventura
tr: Maceraya Katıl

# alreadyExplorerLogin
source: Already an explorer? Log in
es: ¿Ya eres un explorador? Inicia sesión
tr: Zaten bir kaşif misin? Giriş yap

# registerTitle
source: Join Space Adventure
es: Únete a la Aventura Espacial
tr: Uzay Macerası Katıl

# resetPassword
source: Reset Your Password
es: ¡Restablece tu Contraseña!
tr: Şifreni Yenile!

# enterEmailAndReturnToSpace
source: Enter your email and return to space adventures!
es: Ingresa tu dirección de correo electrónico, ¡vuelve a tus aventuras espaciales!
tr: E-posta adresini gir, uzay maceralarına geri dön!

source: Welcome Explorer!
es: ¡Bienvenido Explorador!
tr: Hoş Geldin Kaşif!

source: Magic Story Creator
es: Creador Mágico de Historias
tr: Sihirli Hikaye Yaratıcısı

# createYourUniverse
source: Push the limits of your imagination and create your own universe!
es: ¡Desafía los límites de tu imaginación y crea tu propio universo!
tr: Hayal gücünün sınırlarını zorla ve kendi evrenini yarat!

source: See All
es: Ver Todo
tr: Tümünü Gör

source: My Recent Stories
es: Mis Historias Recientes
tr: Son Hikayelerim

source: My Story Library
es: Mi Biblioteca de Historias
tr: Hikaye Kütüphanem

# deleteStoryTitle
source: Delete Story
es: Eliminar Historia
tr: Hikayeyi Sil

# deleteStoryMessage
source: Are you sure you want to delete this story? This action cannot be undone.
es: ¿Estás seguro de que quieres eliminar esta historia? Esta acción no se puede deshacer.
tr: Bu hikayeyi silmek istediğinizden emin misiniz? Bu işlem geri alınamaz.

source: Cancel
es: Cancelar
tr: İptal

source: Delete
es: Eliminar
tr: Sil

# storyDeletedSuccess
source: Story deleted successfully
es: Historia eliminada exitosamente
tr: Hikaye başarıyla silindi

# storyDeletedError
source: An error occurred while deleting the story: {error}
es: Ocurrió un error al eliminar la historia: {error}
tr: Hikaye silinirken bir hata oluştu: {error}

source: Loading more...
es: Cargando más...
tr: Daha fazla yükleniyor...

# noSavedStories
source: You have no saved stories yet
es: Aún no tienes historias guardadas
tr: Henüz kaydedilmiş hikayeniz yok

# createNewStory
source: Create and save a new story!
es: ¡Crea una nueva historia y guárdala!
tr: Yeni bir hikaye oluşturun ve kaydedin!

# loginPromptMessage
source: Please log in to view your story library
es: Por favor Inicia Sesión Para Ver Tu Biblioteca de Historias
tr: Hikaye Kütüphanenizi Görmek İçin Lütfen Giriş Yapınız

# loginPromptDescription
source: Log in to access all your stories and save new ones.
es: Inicia sesión en tu cuenta para acceder a todas tus historias y guardar nuevas.
tr: Tüm hikayelerinize erişmek ve yeni hikayeler kaydetmek için hesabınıza giriş yapın.

source: Read the Story
es: Leer la Historia
tr: Hikayeyi Oku

# noStoryFound
source: No story found matching your search criteria
es: No se encontraron historias que coincidan con tu búsqueda
tr: Aradığınız kriterlere uygun hikaye bulunamadı

# noStoryShared
source: No story has been shared yet
es: Aún no se han compartido historias
tr: Henüz hikaye paylaşılmamış

# shareFirstStory
source: Be the first to share a story!
es: ¡Sé el primero en compartir una historia!
tr: İlk hikayeyi siz paylaşın!

# searchHintText
source: Search in stories...
es: Buscar en historias...
tr: Hikayelerde ara...

# discoverTitle
source: Discover
es: Descubrir
tr: Keşfet

# loginRequiredTitle
source: Login Required
es: Se Requiere Iniciar Sesión
tr: Giriş Yapmanız Gerekiyor

# loginRequiredMessage
source: Please log in or register to use the story creation feature.
es: Por favor inicia sesión o regístrate para usar la función de creación de historias.
tr: Hikaye oluşturma özelliğini kullanmak için lütfen giriş yapın veya kayıt olun.

source: Mission Center
es: Centro de Misiones
tr: Görev Merkezi

source: Explore Space
es: Explorar el Espacio
tr: Uzayı Keşfet

source: My Collection
es: Mi Colección
tr: Koleksiyonum

source: Explorer
es: Explorador
tr: Kaşif

source: Story End
es: Fin de la Historia
tr: Hikaye Sonu

source: Save to Library
es: Guardar en Mi Biblioteca
tr: Kütüphaneme Kaydet

source: Saving...
es: Guardando...
tr: Kaydediliyor...

source: Swipe to read
es: Desliza para leer
tr: Okumak için kaydırın

# galacticPlace
source: Galactic Location
es: Lugar Galáctico
tr: Galaktik Mekan

source: Space Hero
es: Héroe Espacial
tr: Uzay Kahramanı

source: Time Dimension
es: Dimensión Temporal
tr: Zaman Boyutu

source: Cosmic Feeling
es: Sentimiento Cósmico
tr: Kozmik Duygu

source: Interstellar Event
es: Evento Interestelar
tr: Yıldızlararası Olay

source: Not Selected
es: No seleccionado
tr: Seçilmedi

# exploreSpaceAdventure
source: Explore Your Space Adventure!
es: ¡Explora tu Aventura Espacial!
tr: Uzay Maceranı Keşfet!

# readyToCreate
source: Are you ready to create a galactic story with your selections?
es: ¿Estás listo para crear una historia galáctica con tus selecciones?
tr: Seçtiklerinle galaktik bir hikaye oluşturmaya hazır mısın?

# createStoryButton
source: Create My Story!
es: ¡Crear Mi Historia!
tr: Hikayemi Oluştur!

# dailyLimitReached
source: Daily Limit Exceeded
es: Límite Diario Alcanzado
tr: Günlük Limit Aşıldı

# dailyLimitMessage
source: You have reached the daily limit of creating 1 story. Please subscribe to create more stories.
es: Has alcanzado el límite diario de 1 historia. Por favor suscríbete para crear más historias.
tr: Günlük 1 hikaye oluşturma limitine ulaştınız. Daha fazla hikaye oluşturmak için lütfen abone olunuz.

# okButton
source: OK
tr: Tamam

# subscribeButton
source: Subscribe
es: Suscribirse
tr: Abone Ol

# cancelDialogTitle
source: Do you want to cancel?
es: ¿Deseas Cancelar?
tr: İptal Etmek İstiyor musunuz?

# cancelDialogContent
source: The story creation process is still ongoing. Are you sure you want to cancel?
es: La creación de la historia está en progreso. ¿Estás seguro de que quieres cancelar?
tr: Hikaye oluşturma işlemi devam ediyor. İptal etmek istediğinize emin misiniz?

# noButton
source: No
tr: Hayır

# yesButton
source: Yes
es: Sí
tr: Evet

# galacticPlaceTitle
source: Galactic Location
es: Lugar Galáctico
tr: Galaktik Mekan

# galacticPlaceSubtitle
source: Select the location of your story
es: Elige el lugar donde ocurrirá la historia
tr: Hikayenin geçeceği yeri seç

# spaceHeroTitle
source: Space Hero
es: Héroe Espacial
tr: Uzay Kahramanı

# spaceHeroSubtitle
source: Choose your main character
es: Elige tu personaje principal
tr: Ana karakterini seç

# timeDimensionTitle
source: Time Dimension
es: Dimensión Temporal
tr: Zaman Boyutu

# timeDimensionSubtitle
source: Select the time of your story
es: Elige el tiempo de la historia
tr: Hikayenin zamanını seç

# cosmicEmotionTitle
source: Cosmic Emotion
es: Emoción Cósmica
tr: Kozmik Duygu

# cosmicEmotionSubtitle
source: Select the main emotion of the story
es: Elige la emoción principal de la historia
tr: Hikayedeki ana duyguyu seç

# intergalacticEventTitle
source: Intergalactic Event
es: Evento Intergaláctico
tr: Yıldızlararası Olay

# intergalacticEventSubtitle
source: Select the main event of the story
es: Elige el evento principal de la historia
tr: Hikayedeki ana olayı seç

source: Step
es: Paso
tr: Adım

source: Creating...
es: Creando...
tr: Oluşturuluyor...

# startAdventure
source: Start the Adventure
es: Comenzar Aventura
tr: Maceraya Başla

source: Galactic Story Creator
es: Creador de Historias Galácticas
tr: Galaktik Hikaye Yaratıcısı

source: Loading categories...
es: Cargando categorías...
tr: Kategoriler yükleniyor...

# storySaved
source: Your story has been saved to your library! âœ¨
es: ¡Historia guardada en tu biblioteca! ✨
tr: Hikaye kütüphanenize kaydedildi! ✨

# previewStory
source: Preview Your Story
es: Vista Previa de tu Historia
tr: Hikayeni Önizle

# emailAlreadyInUse
source: This email address is already in use by another explorer! Try a new email.
es: ¡Esta dirección de correo electrónico ya está siendo utilizada por otro explorador! Intenta con un nuevo correo.
tr: Bu e-posta adresi başka bir kaşif tarafından kullanılıyor! Yeni bir e-posta deneyin.

# weakPassword
source: Your password is not strong enough. Choose a password with at least 6 characters, numbers, and special symbols for your space adventure!
es: Tu contraseña no es lo suficientemente fuerte. ¡Elige una contraseña con al menos 6 caracteres, números y caracteres especiales para tu aventura espacial!
tr: Şifreniz yeterince güçlü değil. Uzay macerası için en az 6 karakter, rakam ve özel işaretlerle bir şifre seçin!

# operationNotAllowed
source: Email/password sign-up is currently disabled in the galaxy. Please try again later.
es: El registro con correo electrónico/contraseña está actualmente cerrado en la galaxia. Por favor intenta más tarde.
tr: E-posta/şifre ile kayıt şu anda galakside kapalı. Lütfen daha sonra tekrar deneyin.

# userNotFound
source: No explorer found with this email. Please enter the correct details!
es: No se encontró ningún explorador con este correo electrónico. ¡Por favor ingresa tu información correcta!
tr: Bu e-posta ile bir kaşif bulunamadı. Lütfen doğru bilgilerinizi girin!

# wrongPassword
source: Incorrect password! Please check your star password and try again.
es: ¡Contraseña incorrecta! Por favor verifica tu contraseña estelar e intenta de nuevo.
tr: Hatalı şifre! Lütfen yıldız şifrenizi kontrol edin ve tekrar deneyin.

# userDisabled
source: This account is disabled in the galaxy. Contact support, and we will get you back to the stars!
es: Esta cuenta ha sido desactivada en la galaxia. ¡Contacta al equipo de soporte para volver a las estrellas!
tr: Bu hesap galakside devre dışı. Destek ekibine ulaşın, sizi yıldızlara geri götürelim!

# tooManyRequests
source: Too many login attempts! Wait a while and then return to space.
es: ¡Has intentado iniciar sesión demasiadas veces! Espera un momento y luego vuelve al espacio.
tr: Çok fazla giriş denemesi yaptınız! Bir süre bekleyin ve sonra uzaya geri dönün.

# networkRequestFailed
source: There is an issue with your internet connection. Please check the space signal and try again.
es: Hay un problema con tu conexión a internet. Por favor verifica tu señal espacial e intenta de nuevo.
tr: İnternet bağlantınızda bir sorun var. Lütfen uzay sinyalini kontrol edin ve tekrar deneyin.

# invalidCredential
source: There is an issue with your credentials. Please check your galactic information.
es: Hay un error en tus credenciales. Por favor verifica tu información galáctica.
tr: Kimlik bilgilerinizde bir hata var. Lütfen galaktik bilgilerinizi kontrol edin.

# timeout
source: The operation got lost between the stars! Please try again.
es: ¡La operación se perdió entre las estrellas! Por favor intenta de nuevo.
tr: İşlem yıldızlar arasında kayboldu! Lütfen tekrar deneyin.

# requiresRecentLogin
source: For security, you need to log in again. Please log in and try again.
es: Por seguridad, necesitas iniciar sesión nuevamente. Por favor inicia sesión e intenta de nuevo.
tr: Güvenlik için tekrar giriş yapmanız gerekiyor. Lütfen giriş yapın ve tekrar deneyin.

# genericError
source: Sorry, a galactic error occurred: {message}. Please return to the stars later.
es: Lo sentimos, ocurrió un error galáctico: {message}. Por favor vuelve a las estrellas más tarde.
tr: Üzgünüz, bir galaktik hata oluştu: {message}. Lütfen daha sonra yıldızlara dönün.

# auth_required
source: User session not found.
es: No se encontró sesión de usuario.
tr: Kullanıcı oturumu bulunamadı.

# username_taken
source: This username is already taken.
es: Este nombre de usuario ya está en uso.
tr: Bu kullanıcı adı zaten kullanımda.

# sentToResetPassword
source: Password reset link has been sent to your email!
es: ¡Se ha enviado un enlace para restablecer tu contraseña a tu correo electrónico!
tr: Şifre sıfırlama bağlantısı e-postanıza gönderildi!

# context_missing
source: Language setting could not be retrieved (Missing context).
es: No se pudo obtener la configuración de idioma (Contexto faltante).
tr: Dil ayarı alınamadı (Context eksik).

# missing_locale_context
source: BuildContext is required to determine language code when saving the story.
es: Se requiere BuildContext para determinar el código de idioma para guardar la historia.
tr: Hikayeyi kaydetmek için dil kodunu belirlemek üzere BuildContext gereklidir.

# palette_generation_error
source: Error while generating color palette: {error}
es: Error al generar la paleta de colores: {error}
tr: Renk paleti oluşturulurken hata: {error}

# subscription_required_title
source: Subscription Required
es: Se Requiere Suscripción
tr: Abonelik Gerekli

# subscription_required_desc
source: You need to be a premium subscriber to download the PDF.
es: Necesitas ser un suscriptor premium para descargar PDF.
tr: PDF indirmek için premium abone olmanız gerekiyor.

source: Page
es: Página
tr: Sayfa

# incomplete_selection
source: Please make all selections. Missing: {missing}
es: Por favor completa todas las selecciones. Faltante: {missing}
tr: Lütfen tüm seçimleri yapın. Eksik: {missing}

# emailAddressLabel
source: E-posta
es: Correo Electrónico
